P_SUPPORT_NULL = 57
P_SKILL_NULL = 96

pSupportTree = {
	["11111111"] = {0,14},
	["221111"]   = {1,12},
	["22211"]    = {2,11},
	["2222"]     = {3,10},
	["311111"]   = {4,12},
	["32111"]    = {5,11},
	["3221"]     = {6,10}
}

pSupport = {
	{
		32,
		34,
		35,
		38,
		8,
		41,
		10,
		43,
		14,
		48,
		50,
		51,
		52,
		53,
		54,
		23,
		25,
		42,
		40
	},
	{
		16,
		33,
		4,
		21,
		22,
		39,
		56,
		44,
		11,
		28,
		55,
		49,
		15
	},
	{
		17,
		2,
		19,
		36,
		13,
		45,
		18
	}
}

pSupportO = {
	{
		31
	},
	{
		29,
		6,
		26
	},
	{
		30,
		24,
		7
	},
	{
		20,
		5,
		24
	},
	{
		3,
		7,
		5
	},
	{
		12,
		27,
		6
	},
	{
		37,
		26,
		27
	},
	{
		46,
		47
	}
}

pSupportS = {
	9,
	1
}

pSkillTree = {
	["11111111"] = {0,12},
	["221111"]   = {1,10},
	["22211"]    = {2,09},
	["2222"]     = {3,08},
	["311111"]   = {4,10},
	["32111"]    = {5,09},
	["3221"]     = {6,08}
}

pSkill = {
	{
		32,
		1,
		34,
		35,
		42,
		37,
		15,
		79,
		8,
		25,
		26,
		27,
		33,
		29,
		30,
		47
	},
	{
		80,
		17,
		2,
		4,
		6,
		40,
		9,
		81,
		36,
		28,
		20,
		14,
		31
	},
	{
		39,
		23,
		19,
		12,
		13,
		21,
		7
	}
}

pSkillO = {
	{
		45,
		38
	},
	{
		3,
		10
	},
	{
		16,
		18
	},
	{
		41,
		43
	},
	{
		5,
		46
	},
	{
		24,
		11
	},
	{
		44,
		22
	},
	{
		77,
		78
	}
}

pSkillD = {
	48,
	49,
	50,
	51,
	52,
	53,
	54,
	55,
	56,
	57,
	58,
	59,
	60,
	61,
	62,
	63,
	64,
	65,
	66,
	67,
	68,
	69,
	70,
	71,
	72,
	73,
	74,
	75,
	
	82,
	83,
	84,
	85,
	86,
	87,
	88,
	89,
	90,
	91,
	92,
	93,
	94,
	95
}

pSupportAll = {
	[1] = { name = "薬草笛の技" , pt = 0 },
	[2] = { name = "回復笛の技" , pt = 3 },
	[3] = { name = "真  - 回復笛の技" , pt = 0 },
	[4] = { name = "解毒  - 消臭笛の技" , pt = 2 },
	[5] = { name = "応援笛の技" , pt = 0 },
	[6] = { name = "鬼人笛の技" , pt = 0 },
	[7] = { name = "硬化笛の技" , pt = 0 },
	[8] = { name = "超音波笛の技" , pt = 1 },
	[9] = { name = "プチタル爆弾の技" , pt = 0 },
	[10] = { name = "小タル爆弾の技" , pt = 1 },
	[11] = { name = "大タル爆弾の技" , pt = 2 },
	[12] = { name = "大タル爆弾Gの技" , pt = 0 },
	[13] = { name = "特大タル爆弾の技" , pt = 3 },
	[14] = { name = "打ち上げタル爆弾の技" , pt = 1 },
	[15] = { name = "閃光爆弾の技" , pt = 2 },
	[16] = { name = "設置型爆弾の技" , pt = 2 },
	[17] = { name = "設置型爆弾Gの技" , pt = 3 },
	[18] = { name = "落とし穴の技" , pt = 3 },
	[19] = { name = "シビレ罠の技" , pt = 3 },
	[20] = { name = "毒々落とし穴の技" , pt = 0 },
	[21] = { name = "トランポリンの技" , pt = 2 },
	[22] = { name = "ネコ式活力壺の技" , pt = 2 },
	[23] = { name = "回復贈物の技" , pt = 1 },
	[24] = { name = "緊急撤退の技" , pt = 0 },
	[25] = { name = "巨大ブーメランの技" , pt = 1 },
	[26] = { name = "貫通ブーメランの技" , pt = 0 },
	[27] = { name = "隠密防御の技" , pt = 0 },
	[28] = { name = "武器強化の技" , pt = 2 },
	[29] = { name = "憤怒の技" , pt = 0 },
	[30] = { name = "挑発の技" , pt = 0 },
	[31] = { name = "オトモ鼓舞の技" , pt = 0 },
	[32] = { name = "こやし玉の技" , pt = 1 },
	[33] = { name = "応援ダンスの技" , pt = 2 },
	[34] = { name = "治  - ローリングの技" , pt = 1 },
	[35] = { name = "爆  - ローリングの技" , pt = 1 },
	[36] = { name = "ぶんどりの技" , pt = 3 },
	[37] = { name = "遠隔ぶんどりの技" , pt = 0 },
	[38] = { name = "ネコまっしぐらの技" , pt = 1 },
	[39] = { name = "ネコ爪乱舞の技" , pt = 2 },
	[40] = { name = "しこ踏みドンの技" , pt = 1 },
	[41] = { name = "イガグリ大砲の技" , pt = 1 },
	[42] = { name = "電転虫発射の技" , pt = 1 },
	[43] = { name = "ココ掘れニャンの技" , pt = 1 },
	[44] = { name = "メガブーメランの技" , pt = 2 },
	[45] = { name = "ネコ式火竜車の技" , pt = 3 },
	[46] = { name = "ビースト変化の技" , pt = 0 },
	[47] = { name = "強化咆哮の技" , pt = 0 },
	[48] = { name = "ネコ式回復壺の技" , pt = 1 },
	[49] = { name = "モドリ玉の技" , pt = 2 },
	[50] = { name = "地中まっしぐらの技" , pt = 1 },
	[51] = { name = "設置型砲台の技" , pt = 1 },
	[52] = { name = "鉄  - 転がしニャンの技" , pt = 1 },
	[53] = { name = "爆  - 転がしニャンの技" , pt = 1 },
	[54] = { name = "ネコ式広域笛の技" , pt = 1 },
	[55] = { name = "SP笛の技" , pt = 2 },
	[56] = { name = "キンダンドングリの技" , pt = 2 }
}

pSkillAll = {
	[1] = { name = "体力強化の術 [小]" , pt = 1 },
	[2] = { name = "体力強化の術 [大]" , pt = 2 },
	[3] = { name = "攻撃強化の術 [小]" , pt = 0 },
	[4] = { name = "攻撃強化の術 [大]" , pt = 2 },
	[5] = { name = "防御強化の術 [小]" , pt = 0 },
	[6] = { name = "防御強化の術 [大]" , pt = 2 },
	[7] = { name = "全耐性強化の術" , pt = 3 },
	[8] = { name = "会心強化の術 [小]" , pt = 1 },
	[9] = { name = "会心強化の術 [大]" , pt = 2 },
	[10] = { name = "匠の術" , pt = 0 },
	[11] = { name = "爆弾強化の術" , pt = 0 },
	[12] = { name = "属性攻撃強化の術" , pt = 3 },
	[13] = { name = "状態異常攻撃強化の術" , pt = 3 },
	[14] = { name = "KOの術" , pt = 2 },
	[15] = { name = "減気攻撃強化の術" , pt = 1 },
	[16] = { name = "ガード性能の術 [小]" , pt = 0 },
	[17] = { name = "ガード性能の術 [大]" , pt = 2 },
	[18] = { name = "ガード強化の術" , pt = 0 },
	[19] = { name = "サポート優先の術" , pt = 3 },
	[20] = { name = "サポートプラスの術" , pt = 2 },
	[21] = { name = "サポート行動追加の術" , pt = 3 },
	[22] = { name = "ぶんどり強化の術" , pt = 0 },
	[23] = { name = "復活上手の術" , pt = 3 },
	[24] = { name = "熱  - 爆弾耐性の術" , pt = 0 },
	[25] = { name = "毒耐性の術" , pt = 1 },
	[26] = { name = "風圧無効の術" , pt = 1 },
	[27] = { name = "麻痺無効の術" , pt = 1 },
	[28] = { name = "気絶無効の術" , pt = 2 },
	[29] = { name = "混乱無効の術" , pt = 1 },
	[30] = { name = "耐震の術" , pt = 1 },
	[31] = { name = "防音の術" , pt = 2 },
	[32] = { name = "睡眠無効の術" , pt = 1 },
	[33] = { name = "細菌学の術" , pt = 1 },
	[34] = { name = "防御力DOWN無効の術" , pt = 1 },
	[35] = { name = "だるま早割りの術" , pt = 1 },
	[36] = { name = "七転八起の術 [攻]" , pt = 2 },
	[37] = { name = "七転八起の術 [防]" , pt = 1 },
	[38] = { name = "背水の陣の術" , pt = 0 },
	[39] = { name = "怒り発動強化の術" , pt = 3 },
	[40] = { name = "反撃サポート上昇の術" , pt = 2 },
	[41] = { name = "モンスター探知の術" , pt = 0 },
	[42] = { name = "ブーメラン上手の術" , pt = 1 },
	[43] = { name = "罠設置上手の術" , pt = 0 },
	[44] = { name = "採取専門の術" , pt = 0 },
	[45] = { name = "サボりお仕置きの術" , pt = 0 },
	[46] = { name = "体力増加演奏の術" , pt = 0 },
	[47] = { name = "黄金魚狙いの術" , pt = 1 },
	[48] = { name = "最高のネコよ！の術" , pt = 0 },
	[49] = { name = "ハイケイデンスの術" , pt = 0 },
	[50] = { name = "地上最強の術" , pt = 0 },
	[51] = { name = "ゾンビーの術" , pt = 0 },
	[52] = { name = "絶体絶命の術" , pt = 0 },
	[53] = { name = "長飛丸の術" , pt = 0 },
	[54] = { name = "ファナリスの術" , pt = 0 },
	[55] = { name = "エーラの術" , pt = 0 },
	[56] = { name = "遠隔攻撃強化の術" , pt = 0 },
	[57] = { name = "プチタル爆弾改造の術" , pt = 0 },
	[58] = { name = "着こなし上手の術" , pt = 0 },
	[59] = { name = "ユニバーサルの術" , pt = 0 },
	[60] = { name = "きりみ弁当の術" , pt = 0 },
	[61] = { name = "ぐでぐでの術" , pt = 0 },
	[62] = { name = "歌姫の術" , pt = 0 },
	[63] = { name = "風のタクトの術" , pt = 0 },
	[64] = { name = "ランドマスターの術" , pt = 0 },
	[65] = { name = "スーパーキノコの術" , pt = 0 },
	[66] = { name = "あきんどの術" , pt = 0 },
	[67] = { name = "トライフォースの術" , pt = 0 },
	[68] = { name = "メガフレアの術" , pt = 0 },
	[69] = { name = "防御優先の術" , pt = 0 },
	[70] = { name = "体力強化優先の術" , pt = 0 },
	[71] = { name = "火耐性強化の術" , pt = 0 },
	[72] = { name = "水耐性強化の術" , pt = 0 },
	[73] = { name = "雷耐性強化の術" , pt = 0 },
	[74] = { name = "氷耐性強化の術" , pt = 0 },
	[75] = { name = "龍耐性強化の術" , pt = 0 },
	
	[77] = { name = "超会心の術" , pt = 0 },
	[78] = { name = "回復速度＋の術" , pt = 0 },
	[79] = { name = "爆弾爆破追加の術" , pt = 1 },
	[80] = { name = "怒り延長の術" , pt = 2 },
	[81] = { name = "回避上手の術" , pt = 2 },
	[82] = { name = "経験上手の術" , pt = 0 },
	[83] = { name = "水属性強化の術" , pt = 0 },
	[84] = { name = "氷属性強化の術" , pt = 0 },
	[85] = { name = "龍属性強化の術" , pt = 0 },
	[86] = { name = "SP状態延長の術" , pt = 0 },
	[87] = { name = "弱点特効の術" , pt = 0 },
	[88] = { name = "潜り上手の術" , pt = 0 },
	[89] = { name = "根性の術" , pt = 0 },
	[90] = { name = "ビースト延長の術" , pt = 0 },
	[91] = { name = "カブリもの上手の術" , pt = 0 },
	[92] = { name = "ネコ加護の術" , pt = 0 },
	[93] = { name = "運搬上手の術" , pt = 0 },
	[94] = { name = "防御超優先の術" , pt = 0 },
	[95] = { name = "転がり転がし上手の術" , pt = 0 }
}
